documents/MtomRequestExample.xml

<!-- http headers -->
{
    'User-Agent': 'Zeep/4.2.1 (www.python-zeep.org)',
    'Accept-Encoding': 'gzip, deflate',
    'Accept': '*/*',
    'Connection': 'keep-alive',
    'SOAPAction': '""',
    'Content-Type': 'multipart/related;
        type="application/xop+xml";
        start="rootpart@pymtom-xop";
        start-info="text/xml";
        boundary="uuid:0eb80abd-bc7e-4839-aacf-c914134ea749"',
    'MIME-Version': '1.0',
    'Content-Length': '915'
}


<!-- request body -->
--uuid:0eb80abd-bc7e-4839-aacf-c914134ea749\r\n
Content-Type: application/xop+xml; charset=UTF-8; type="text/xml"\r\n
Content-Transfer-Encoding: 8bit\r\n
Content-ID:<rootpart@pymtom-xop>\r\n\r\n

<?xml version=\'1.0\' encoding=\'utf-8\'?>\n
<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Body>
        <ns0:uploadFile xmlns:ns0="http://service-test.com/">
            <arg0>
                <file>
                    <xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="cid:168893477275.4396.14683110815057156485@pymtom-xop"/>
                </file>
                <fileName>test</fileName>
                <fileExtension>pdf</fileExtension>
            </arg0>
        </ns0:uploadFile>
    </soap-env:Body>
</soap-env:Envelope>\r\n

--uuid:0eb80abd-bc7e-4839-aacf-c914134ea749\r\n
Content-Type: application/pdf\r\n
Content-Transfer-Encoding: binary\r\n
Content-ID: <168893477275.4396.14683110815057156485@pymtom-xop>\r\n
Content-Disposition: attachment; name="test.pdf"\r\n\r\n

<!-- file's binary data -->

--uuid:0eb80abd-bc7e-4839-aacf-c914134ea749--
